[
    {
        "id": 1,
        "imageName": "calculus",
        "name": "Calculus: An Intuitive and Physical Approach",
        "category": "Math",
        "price": "$22.99",
        "author": "Morris Kline",
        "description": "Application-oriented introduction relates the subject as closely as possible to science. In-depth explorations of the derivative, the differentiation and integration of the powers of x, and theorems on differentiation and antidifferentiation lead to a definition of the chain rule and examinations of trigonometric functions, logarithmic and exponential functions, techniques of integration, polar coordinates, much more. Clear-cut explanations, numerous drills, illustrative examples. 1967 edition. Solution guide available upon request.",
        "isFeatured": false,
        "isFavorite": true
    },
    {
        "id": 2,
        "imageName": "discretemathematics",
        "name": "Discrete Mathematics",
        "category": "Math",
        "price": "$65.55",
        "author": "Norman L. Biggs",
        "description": "The long-awaited second edition of Norman Bigg's best-selling Discrete Mathematics, includes new chapters on statements and proof, logical framework, natural numbers, and the integers, in addition to updated chapters from the previous edition. Carefully structured, coherent and comprehensive, each chapter contains tailored exercises and solutions to selected questions, and miscellaneous exercises are presented throughout. This is an invaluable text for students seeking a clear introduction to discrete mathematics, graph theory, combinatorics, number theory and abstract algebra.",
        "isFeatured": true,
        "isFavorite": false
    },
    {
        "id": 3,
        "imageName": "thebiologybook",
        "name": "The Biology Book",
        "category": "Science",
        "price": "$10.22",
        "author": "Michael C. Gerald",
        "description": "From the emergence of life, to Leewenhoek's microscopic world, to GMO crops, The Biology Book presents 250 landmarks in the most widely studied scientific field. Brief, engaging, and colorfully illustrated synopses introduce readers to every major subdiscipline, including cell theory, genetics, evolution, physiology, thermodynamics, molecular biology, and ecology. With information on such varied topics as paleontology, pheromones, nature vs. nurture, DNA fingerprinting, bioenergetics, and so much more, this lively collection will engage everyone who studies and appreciates the life sciences.",
        "isFeatured": false,
        "isFavorite": false
    },
    {
        "id": 4,
        "imageName": "thegreatgatsby",
        "name": "The Great Gatsby",
        "category": "Novel",
        "price": "$4.90",
        "author": "F. Scott Fitzgerald",
        "description": "The Great Gatsby is a 1925 novel by American writer F. Scott Fitzgerald. Set in the Jazz Age on Long Island, the novel depicts narrator Nick Carraway's interactions with mysterious millionaire Jay Gatsby and Gatsby's obsession to reunite with his former lover, Daisy Buchanan. A youthful romance Fitzgerald had with socialite Ginevra King, and the riotous parties he attended on Long Island's North Shore in 1922 inspired the novel. Following a move to the French Riviera, he completed a rough draft in 1924. He submitted the draft to editor Maxwell Perkins, who persuaded Fitzgerald to revise the work over the following winter. After his revisions, Fitzgerald was satisfied with the text, but remained ambivalent about the book's title and considered several alternatives. The final title he desired was Under the Red, White, and Blue. Painter Francis Cugat's final cover design impressed Fitzgerald who incorporated a visual element from the art into the novel.",
        "isFeatured": true,
        "isFavorite": false
    },
    {
        "id": 5,
        "imageName": "allofstatistics",
        "name": "All of Statistics: A Concise Course in Statistical Inference",
        "category": "Math",
        "price": "$55.72",
        "author": "Larry Wasserman",
        "description": "Taken literally, the title All of Statistics is an exaggeration. But in spirit, the title is apt, as the book does cover a much broader range of topics than a typical introductory book on mathematical statistics. This book is for people who want to learn probability and statistics quickly. It is suitable for graduate or advanced undergraduate students in computer science, mathematics, statistics, and related disciplines. The book includes modern topics like non-parametric curve estimation, bootstrapping, and classification, topics that are usually relegated to follow-up courses. The reader is presumed to know calculus and a little linear algebra. No previous knowledge of probability and statistics is required. Statistics, data mining, and machine learning are all concerned with collecting and analysing data.",
        "isFeatured": true,
        "isFavorite": false
    },
    {
        "id": 6,
        "imageName": "middlemarch",
        "name": "Middlemarch",
        "category": "Novel",
        "price": "$3.95",
        "author": "George Eliot",
        "description": "Introduction and Notes by Doreen Roberts, Rutherford College, University of Kent at Canterbury Middlemarch is a complex tale of idealism, disillusion, profligacy, loyalty and frustrated love. This penetrating analysis of the life of an English provincial town during the time of social unrest prior to the Reform Bill of 1832 is told through the lives of Dorothea Brooke and Dr Tertius Lydgate and includes a host of other paradigm characters who illuminate the condition of English life in the mid-nineteenth century.",
        "isFeatured": false,
        "isFavorite": false
    },
    {
        "id": 7,
        "imageName": "theadventuresofhuckleberryfinn",
        "name": "The Adventures of Huckleberryfinn",
        "category": "Novel",
        "price": "$5.39",
        "author": "Mark Twain",
        "description": "Referring to Adventures of Huckleberry Finn, H. L. Mencken noted that his discovery of this classic American novel was the most stupendous event of my whole life; Ernest Hemingway declared that all modern American literature stems from this one book, while T. S. Eliot called Huck one of the permanent symbolic figures of fiction, not unworthy to take a place with Ulysses, Faust, Don Quixote, Don Juan, Hamlet. The novel's preeminence derives from its wonderfully imaginative re-creation of boyhood adventures along the Mississippi River, its inspired characterization, the author's remarkable ear for dialogue, and the book's understated development of serious underlying themes: natural man versus civilized society, the evils of slavery, the innate value and dignity of human beings, and other topics. Most of all, Huckleberry Finn is a wonderful story, filled with high adventure and unforgettable characters.",
        "isFeatured": true,
        "isFavorite": false
    },
    {
        "id": 8,
        "imageName": "thestoriesofantonchekhov",
        "name": "The Stories of Anton Chekhov",
        "category": "Novel",
        "price": "$13.99",
        "author": "Anton Chekhov",
        "description": "Richard Pevear and Larissa Volokhonsky, the highly acclaimed translators of War and Peace, Doctor Zhivago, and Anna Karenina, which was an Oprah Book Club pick and million-copy bestseller, bring their unmatched talents to The Selected Stories of Anton Chekhov, a collection of thirty of Chekhov’s best tales from the major periods of his creative life Considered the greatest short story writer, Anton Chekhov changed the genre itself with his spare, impressionistic depictions of Russian life and the human condition. From characteristically brief, evocative early pieces such as “The Huntsman” and the tour de force “A Boring Story,” to his best-known stories such as “The Lady with the Little Dog” and his own personal favorite, “The Student,” Chekhov’s short fiction possesses the transcendent power of art to awe and change the reader. This monumental edition, expertly translated, is especially faithful to the meaning of Chekhov’s prose and the unique rhythms of his writing, giving readers an authentic sense of his style and a true understanding of his greatness.",
        "isFeatured": true,
        "isFavorite": false
    },
    {
        "id": 9,
        "imageName": "relativity",
        "name": "Relativity: The Special and General Theory",
        "category": "Science",
        "price": "$9.95",
        "author": "Albert Einstein",
        "description": "From the age of Galileo until the early years of the 20th century, scientists grappled with seemingly insurmountable paradoxes inherent in the theories of classical physics. With the publication of Albert Einstein's special and general theories of relativity, however, traditional approaches to solving the riddles of space and time crumbled. In their place stood a radically new view of the physical world, providing answers to many of the unsolved mysteries of pre-Einsteinian physics. Acclaimed as the pinnacle of scientific philosophy, the theories of relativity tend to be regarded as the exclusive domain of highly trained scientific minds. The great physicist himself disclaimed this exclusionary view, and in this book, he explains both theories in their simplest and most intelligible form for the layman not versed in the mathematical foundations of theoretical physics.",
        "isFeatured": false,
        "isFavorite": false
    },
    {
        "id": 10,
        "imageName": "hamlet",
        "name": "Hamlet",
        "category": "Novel",
        "price": "$9.95",
        "author": "William Shakespeare",
        "description": "Hamlet is Shakespeare's most popular, and most puzzling, play. It follows the form of a revenge tragedy, in which the hero, Hamlet, seeks vengeance against his father's murderer, his uncle Claudius, now the king of Denmark. Much of its fascination, however, lies in its uncertainties. Among them: What is the Ghost--Hamlet's father demanding justice, a tempting demon, an angelic messenger? Does Hamlet go mad, or merely pretend to? Once he is sure that Claudius is a murderer, why does he not act? Was his mother, Gertrude, unfaithful to her husband or complicit in his murder?",
        "isFeatured": true,
        "isFavorite": true
    }
]
